{
    "pageName": "home",
    "sections": [
        {
            "title": "hero",
            "content": {
                "headings": ["Hi, my name is", "Alexander Hom"],
                "subHeadings": ["I am a software engineer from", "San Francisco"],
                "text": [],
                "images": [],
                "icons": [],
                "buttons": [],
                "listContent": []
            }
        },
        {
            "title": "overview",
            "content": {
                "headings": ["A brief overview"],
                "subHeadings": [],
                "text": [
                    "I have three years of professional software engineering experience developing client-side web applications as well as enterprise APIs", 
                    "I am proficient in various programming languages and technologies, including Java, Python, JavaScript, relational and NoSQL databases, CI/CD pipelines, and Google Cloud", 
                    "I enjoy tackling challenges and collaborating with people to design and develop solutions to complex problems", 
                    "I like learning about the latest technologies and applying the knowledge to my work to improve application performance and efficiency"
                ],
                "images": [],
                "icons": ["terminal", "code", "heart", "book"],
                "buttons": [],
                "listContent": []
            }
        },
        {
            "title": "reflection",
            "content": {
                "headings": ["A tale of two passions: art and technology"],
                "subHeadings": [],
                "text": ["Growing up, two of my interests were art and technology. I enjoyed creating objects with Lego, folding origami, and designing architectural structures. At the same time, I was fascinated with the inner workings of websites and was very enthusiastic about developing my own. Today, as a software engineer, I get to combine my two passions as part of the software development process — putting on my artist cap when designing user interfaces and applying my interest in technology while programming applications using the latest technologies."],
                "images": [],
                "icons": [],
                "buttons": [],
                "listContent": []
            }
        },
        {
            "title": "experience",
            "content": {
                "headings": ["Full stack development expertise"],
                "subHeadings": ["Frontend", "Backend", "Cloud"],
                "text": [
                    "Proficient in designing responsive web applications with Figma and developing them with modern JavaScript using React and its ecosystem of tools and packages, like Redux", 
                    "Experienced in developing large-scale microservices using various backend frameworks and technologies, like Spring Boot and Flask, and testing APIs using frameworks, such as JUnit and Karate", 
                    "Knowledgable in developing and deploying applications using Google Cloud Platform and cloud-native technologies, such as Kubernetes"
                ],
                "images": [],
                "icons": [],
                "buttons": [],
                "listContent": []
            }
        },
        {
            "title": "projects",
            "content": {
                "headings": ["Projects I've Worked On"],
                "subHeadings": ["Minimal Todo List", "Encapsulate", "Nocturnal"],
                "text": [
                    "Web-based todo list with a simple user interface. Features include creating, removing, and searching todos.", 
                    "Technology and software engineering blog.", 
                    "Minimalistic social networking Android application. Users can view and create posts, which are saved to a Parse database."
                ],
                "images": [],
                "icons": [],
                "buttons": [
                    {
                        "label": "GitHub",
                        "url": "https://github.com/robokae/Minimal-React-Todo-List"
                    },
                    {
                        "label": "GitHub",
                        "url": "https://github.com/EncapsulateSocial/Encapsulate"
                    },
                    {
                        "label": "GitHub",
                        "url": "https://github.com/UCM-CodePath-Social-Media/Nocturnal"
                    }
                ],
                "listContent": [
                    ["React", "Sass"],
                    ["React", "Sass", "Spring Boot"],
                    ["Java", "Parse"]
                ]
            }
        }
    ]
}